* * * * * * * * * * * * * * *
*                           *
     FUNCTION  C          &&* ВОЗВРАЩАЕТ ИЗМЕНЕНЫЙ ЦВЕТ И МЕНЯЕТ ЦВЕТ
*    PROCEDURE C            * СТРОКА С ТАБЛИЦЕЙ ЦВЕТОВ В ПЕРЕМЕННОЙ SYSCOLORC !
* * * * * * * * * * * * * * *
PARAMETER C__Np && Две цифры XY:
*адр. X                 Y
*  1  1 Фон
*  6  2 Заголовок       1 Сообщ. 2 Рамка
* 11  3 Сообщение       1 Сообщ. 2 Рамка
* 16  4 Сообщение No 2  1 Сообщ. 2 Рамка
* 21  5 Меню            1 Загол. 2 Рамка 3 Меню      (4 Выделенный)
* 26  6 Подвал          1 Сообщ.         3 Выделенный
* 31  7 Помощь          1 Текст  2 Рамка 3 Выделенный 4 Заголовок
* 36  8 Предупреждение  1 Сообщ. 2 Рамка
* 41  9 Ввод                     2 Рамка 3 Ввод      (4 Невыбранный)
* 56  Пробел
*     При каждом обращении заменяется только один основной цвет и
*         только при 53 и 93 заменяется два цвета, а при 10 - все три:
*         Меню:  Станд./Выдел.
*         Ввод:  Выдел./Невыбр.
*     Если вторая цифра 5, то изменяется только цвет бордюра.(Отменено)
*     Если число отрицательное (0,-FF), то берется цвет прямо из таблиц
*                                  12 - 1буква/2фон
* Смотри по тексту программы коментарии: Clipper и FoxBase, чтобы адаптировать.
*
*         0   1   2   3   4   5   6   7   8   9   10  11  12  13  14  15
STROKAC1="N   N+  B   B+  G   G+  BG  BG+ R   R+  RB  RB+ GR  GR+ W   W+  "
STROKAC2="N   B   G   BG  R   RB  GR  W   N*  B*  G*  BG* R*  RB* GR* W*  "
* ВЫДЕЛЕНИЕ СИМВОЛА ИЗ НАСТРОЕЧНОЙ ТАБЛИЦЫ
     C__N  =C__Np
if   C__N  <= 0            && (0,-FF)
     C__N1 = INT(-C__N /16)
     C__N2 =-C__N-C__N1*16
     C__1p =TRIM(SUBSTR(STROKAC1,C__N1*4+1,4))+"/"+TRIM(SUBSTR(STROKAC2,C__N2*4+1,4))
     set color to (C__1P)
     return C__1p
endif
IF   C__Np = 10
     C__N  = 93
     C__1  =SUBSTR(SYSCOLORC,1,1)
     C__N0 =ASC(C__1)
     C__N1 =INT(C__N0/16)
     C__N2 =C__N0-C__N1*16
     C__1p =TRIM(SUBSTR(STROKAC1,C__N1*4+1,4))+"/"+TRIM(SUBSTR(STROKAC2,C__N2*4+1,4))
ENDIF
C__N1=INT(C__N/10)
IF C__N1 < 1
   C__N1 = 1
ENDIF
C__N2=C__N-C__N1*10
IF C__N2 < 1
   C__N2 = 1
ENDIF
C__N2W=C__N2
C__A=C__N1*5+C__N2-5
C__N0=LEN(SYSCOLORC)
IF C__A > C__N0
   C__A = C__N0
ENDIF
*
C__3=SUBSTR(SYSCOLORC,C__N1*5,1)          && БОРДЮР
C__N0=ASC(C__3)
C__N1=INT(C__N0/16)
C__N2=C__N0-C__N1*16
C__3=TRIM(SUBSTR(STROKAC1,C__N1*4+1,4))
*
C__1=SUBSTR(SYSCOLORC,C__A  ,1)           && ОСНОВНОЙ
C__N0=ASC(C__1)
C__N1=INT(C__N0/16)
C__N2=C__N0-C__N1*16
C__1=TRIM(SUBSTR(STROKAC1,C__N1*4+1,4))+"/"+TRIM(SUBSTR(STROKAC2,C__N2*4+1,4))
*
C__2=SUBSTR(SYSCOLORC,C__A+1,1)           && ДОПОЛНИТЕЛЬНЫЙ
C__N0=ASC(C__2)
C__N1=INT(C__N0/16)
C__N2=C__N0-C__N1*16
C__2=TRIM(SUBSTR(STROKAC1,C__N1*4+1,4))+"/"+TRIM(SUBSTR(STROKAC2,C__N2*4+1,4))
* Clipper: "Станд., Выд., Бордюр, Фон, Невыбранный"
          C__0=SETCOLOR()+" "
* FoxBase: "Станд., Выд., Бордюр"
*         C__0=SYSCOLOR+",, "  && Так как нет функции подобной SETCOLOR(),
*                                 цвет хранится в переменной SYSCOLOR
* ПОЛУЧЕНИЕ ВСЕХ ПЯТИ ЦВЕТОВ
C__N1=AT(",",C__0)
C__C1=SUBSTR(C__0,1,C__N1-1)              && Станд.
C__0 =SUBSTR(C__0,C__N1+1)
  C__N1=AT(",",C__0)
  C__C2=SUBSTR(C__0,1,C__N1-1)            && Выд.
  C__0 =SUBSTR(C__0,C__N1+1)
    C__N1=AT(",",C__0)
    C__C3=SUBSTR(C__0,1,C__N1-1)          && Бордюр
    C__0 =SUBSTR(C__0,C__N1+1)
      C__N1=AT(",",C__0)
      C__C4=SUBSTR(C__0,1,C__N1-1)        && Фон
      C__0 =SUBSTR(C__0,C__N1+1)
        C__C5=C__0                        && Невыбранный
*  "Станд., Выд., Бордюр, Фон, Невыбранный"
DO CASE
   CASE C__Np=10                          && ФОН
     C__1=C__1p+","+C__1  +","+C__C3+","+C__C4+","+C__2
   CASE C__N=53                           &&  Меню: Станд., Выд.
     C__1=C__1 +","+C__2  +","+C__C3
   CASE C__N=93                           &&  Ввод: Выд.    Невыбранный
     C__1=C__C1+","+C__1  +","+C__C3+","+C__C4+","+C__2
***CASE C__N2W=5                           &&  Только Бордюр !
***  C__1=C__C1+","+C__C2 +","+C__3 +","+C__C4+","+C__C5
OTHERWISE
     C__1=C__1 +","+C__C2+","+C__C3
ENDCASE
* Clipper:
          SET COLOR TO (C__1)
* FoxBase: (Лишние символы, но работает)
*         SET COLOR TO &C__1
          RETURN        C__1
