@echo off
echo     ╓────────────────────────────────────────────────╖
echo     ║     Производится установка системы  G&K        ║
echo     ╙────────────────────────────────────────────────╜
rem ======================================================================
rem     Вызов программы для первоначальной проверки жесткого диска
rem ======================================================================
a:\setup.exe
rem ======================================================================
rem  Получим следующие коды  ошибок :  = 0 - Ok
rem                                   !=0  - Ошибка
rem         Если создан файл системного журнала, посмотрим его
rem ======================================================================
if not errorlevel == 0 goto Error
if not exist c:\sys$log.err goto Continue
a:\logview
:Continue
rem ======================================================================
rem              Копирование файлов системы на жесткий диск
rem ======================================================================
copy main.exe c:\G&K >nul
copy tutor.doc c:\g&k >nul
copy g&k.dat c:\g&k >nul
copy v.dat c:\g&k > nul
copy logrec.dat c:\g&k > nul
copy edit.exe c:\g&k > nul
copy start.bat c:\g&k > nul
copy logview.exe c:\g&k > nul
copy crcfile.exe c:\g&k > nul
echo     ╓────────────────────────────────────────────────╖
echo     ║         Система   G&K   установлена            ║
echo     ╙────────────────────────────────────────────────╜
goto Quit
:Error
echo  Ошибка при первом старте Программы уничтожения вирусов
:Quit
