                 Министерство гражданской авиации

          Киевский институт инженеров гражданской авиации

                          Авиацентр НТТМ








    ПРОГРАММА ПЕРВОЙ ВСЕСОЮЗНОЙ НАУЧНО-ТЕХНИЧЕСКОЙ КОНФЕРЕНЦИИ


         "Методы и средства защиты от компьютерных вирусов

                  в операционной системе MS DOS"



                       14-17 ноября 1990 г.
                              г.Киев













                          Киев-КИИГА 1990
.

                          БЛАГОДАРНОСТИ

     Ряд организаций  содействовал проведению конференции, оказав
финансовую помощь Оргкомитету или  установив  специальные  премии
для  участников конкурса.  От имени Оргкомитета выражаю благодар-
ность Сергею Григорьевичу Антимонову - директору  Научного центра
СП "Диалог" при ВЦ АН СССР,  Григорию Евгеньевичу Попову - дирек-
тору Киевского филиала СП "Новинтех", Геннадию Павловичу Тарасову
- директору ЦНКБ ВT ГКВТИ CCCР, Анатолию Абовичу Эйдесу - руково-
дителю издательского отдела СП "Интерюнити".

                                                       Оргкомитет




                     ОРГКОМИТЕТ КОНФЕРЕНЦИИ


Председатель оргкомитета:                         Безруков Н.Н.

Зам.председателя,
зам. директора Авиацентра НТТМ:                   Белоусов А.Ф.

Секретарь:                                        Ткаченко Г.Э.

Члены оргкомитета:  Кучма Е.E.,Лященко Ю.П.

   Адрес оргкомитета: 252058 Киев-58, пр. Космонавта Комарова 1,
КИИГА, корп. 3, Авиацентр НТТМ, тел. 484-94-63

.
          Открытие конференции  14 ноября (10.30-13.00)

 Безруков Н.Н.(Киев).  Актуальные проблемы компьютерной виру-
     сологии (стелс-вирусы, файлово-бутовые вирусы, LAN-вирусы).

 Бончев В.(София).  Развитие вирусологии в Болгарии; ответы
     на вопросы участников семинара

 Лозинский Д.Н.(Москва). Aidstest: первые два года.

 Тарасов Г.П., Семенов В.А.(Киев, ЦНКБ ВТ ГКВТИ). Вирусная
     проблематика в контексте задач защиты от несанкционированного доступа.


           Вечернее заседание 14 ноября (15.00-19.00)

     Секция 1: Общие проблемы компьютерной вирусологии. Классифи-
кация  вирусов и методы анализа вирусоподобных программ,  инстру-
ментальные средства вирусолога  (руководитель  секции  Н.Н.Безру-
ков).

 Водяник А.Г.(Мариуполь). Некоторые утилиты для анализа прог-
     раммного обеспечения.

 Волынский В.В.(Москва).  Использование Periscope для анализа
     программного обеспечения.

 Карасик И.Ш.(Москва). Вирусы как продукт естественной эволю-
     ции программного обеспечения.

 Кохманюк Д.С.(Киев).  Опыт использования Quaid Analizer  для
     исследования программного обеспечения.

 Свиридов И.А.(Киев). Роль BBS в борьбе с вирусам (на примере
     электронной конференции по вирусам FIDO).

 Селивоненко А.Б.(Полтава). Шпион 21 прерывания.

 Касперский Е.В.(Москва).  Методика  работы  с дизассемблером
     Sourcer.

 Цал М.И.(Ленинград). Современный уровень написания вирусов и
     возможность создания универсального детектора и резидентных
     программ.

 Сотников С.Н.(Минск). Некоторые статистические закономерности
     поступления вирусов в СССР.
.
             Утреннее заседание 15 ноября (10.00-13.00)
     Секция 2: Интегрированные антивирусные системы. Полифаги.
               (руководитель секции Д.Н.Лозинский).

 Грязнов Д.О.(Переславль-Залесский).  Антивирусная система
     PC Shield.

 Касперский Е.Н.(Москва). Полифаг -V.

 Котик О.Г.(Москва). Система Anti-Kot/Anti-Kor.

 Свиридов И.А.(Киев). Пакетный универсальный детектор-фаг для
     бутовых вирусов.

 Сербиненко А.В.(Донецк).  Сравнительный анализ пользователь-
     ского интерфейса в полифагах.

 Сусликов Е.Н.(Кемерово). Незаражаемый высокоскоростной поли-
     фаг с самонастройкой на детектирование новых вирусов.

 Сысоев И.В.(Москва). Полифаг AV.

 Юдин Г.Т.,  Биллиг И.В.(Тверь). Интегрированная антивирусная
     среда Авиценна.


           Вечернее заседание 15 ноября (15.00-19.00)

     Секция 3:  Вопросы конструирования детекторов, конструирова-
ние ревизоров,  контроль целостности MS DOS (руководитель  секции
Е.В.Касперский).

 Ветров И.В.(Москва).  Пакет программ "Ревизор".

 Герасимов В.В.(Москва). Новая версия ревизора DLI.

 Мостовой Д.Ю. (Москва). Некоторые аспекты реализации ревизоров.

 Рабец В.С.(Черноголовка). Детектор, интегрированный с Norton
     Commander.

 Румянцев М.И.(Донецк). Spirit - средство контроля целостности
     MS DOS.

 Суворов И.А.(Киев). Полидетектор с ускоренным поиском
     сигнатур и возможностью ввода данных из таблиц
     "Компьютерной вирусологии".
.
 Судленков Г.О.(Минск).  Ревизор с возможностью нейтрализации
     файловых вирусов, дописывающихся в хвост файла.

 Шеховцов А.Л.(Киев). Полидетектор с диалоговым интерфейсом и
     возможностью ввода сигнатур для контекстного поиска.


          Утреннее заседание 16 ноября (9.00 - 13.00)
     Секция 4: Конструирование резидентных программ защиты, мето-
ды контроля "on the fly" (руководитель А.Г.Водяник).

 Водяник А.Г.(Мариуполь).  Intellectual Writе Protector - гиб-
     кое сочетание аппаратных и программных методов защиты.

 Двоеглазов И.М.(Киев). Резидентный сторож, контролирующий 21
     прерывание.

 Касперский Е.Н.(Москва). Резидентные сторожа -D1, -D2, -D3.

 Катюшкин А.В.(Москва).  Резидентный монитор  с  расширенными
     возможностями.

 Пономаренко В.В.(Киев). Резидентная поливакцина.


          Вечернее заседание 16 ноября (15.00 - 19.00)
     Секция 5. Нетрадиционные методы защиты от вирусов, незаража-
емые и самоизлечивающиеся программы (руководитель  Н.Н.Безруков).

 Бабанин В.М.(Тверь).  Универсальная антивирусная вакцина  от
     файловых вирусов, имплантирующихся в конец файла.

 Волынский В.В.(Москва). Вирус против вирусов.

 Сесса А.В.  (Днепропетровск). Нейтрализация произвольных бу-
     товых вирусов при загрузке ДОС.

 Сусликов Е.Н.(Кемерово). Эвристические  методы поиска новых
     вирусов в незаражаемом полидетекторе LD.

 Рахимов А.Р., Турсунов О.О.(Газалкент). Антивирусная система
     Cerber.

 Фиалков А.В.(Москва). Универсальное вакцинирование программ
     от файловых вирусов присоединяемым детектором-защитником.

                        Д и с к у с с и я:
"Меры воздействия и  возможные  санкции против  разработчиков
                  и распространителей вирусов"
.
          Утреннее заседание 17 ноября (10.00 - 12.00)
     Секция 6:  Методы и алгоритмы защиты от несанкционированного
копирования коммерческого ПО (руководитель секции В.Герасимов).

 Даен И.Л.,  Маковенко А.Т.(Киев). Средства защиты от копиро-
      вания данных, основанные на применениии ключей.

 Герасимов В.В.(Москва).  Классификация систем защиты от  не-
      санкционированного  копирования  и  некоторые оценки сложности
      их вскрытия.

 Рик А.В.(Тверь).   Метод   комплексной   защиты  программных
      средств на дискетах и винчестерах.


              Закрытие конференции (12.00 - 14.00)

    Безруков Н.Н.  Итоги  конкурса антивирусных программ,  расп-
ространяемых бесплатно. Награждение победителей.
    Принятие заключительных документов,  определение даты прове-
дения следующей конференции.
