/* Turbo C.
 * Программа "Пианино", авторы В.Боковой, А.Синев.
 * Программа выводит на экран клавиатуру пианино, из которого
 * можно извлекать звуки при помощи мыши.
 * Расчет частоты тона производится по формулам:
 *     частота_До = 32.75 * (2^(номер_октавы-1)),
 * для нот текущей октавы
 *     частота_ноты_i = частота_До * (2^(i/12)),
 * где номер_октавы = 0 соответствует субконтроктаве.
 * Программа рассчитана на работу с видеоадаптерами EGA или VGA.
 */

#include <stdio.h>
#include <stdlib.h>
#include <graphics.h>
#include <dos.h>
#include <conio.h>
#include <math.h>

#define Radix 10		/* Основание системы счисления */

void play(void);		/* Работа с мышью */
void oct_freq(int);		/* Расчет частот нот октавы */
void show_freq(int);		/* Вывести частоту тона на экран */
void hide_cursor(void);		/* Сделать курсор невидимым */
void init_graph(void);		/* Инициализация графической системы */
int init_mouse(void);		/* Инициализация мыши */
void set_cursor_position(void);	/* Установить курсор в заданную позицию */
void set_mickey_pixel(void);	/* Установить соотношение микки-пиксел */
void set_cursor_shape(void);	/* Задать параметры курсора */
void show_cursor(void);		/* Сделать курсор видимым */
void read_cursor(void);		/* Определить местоположение курсора */

unsigned int notes[12];	        /* Массив частот нот текущей октавы */

struct REGPACK ioregs;		/* Регистры 80i86 */

/***********************************@********************************/

void main(void)
{
  register int i;		    /* Счетчик */

  init_graph();			    /* Инициализация графической системы */
  init_mouse();			    /* Инициализация мыши */
  set_cursor_shape();		    /* Задать параметры курсора */
  set_cursor_position();	    /* Установить курсор в заданную позицию */
  set_mickey_pixel();		    /* Установить соотношение микки-пиксел */
  setfillstyle(SOLID_FILL, BLUE);   /* Задать модель вывода */
  bar(0, 0, 639, 349);		    /* Заполнить экран синим */
  setcolor(WHITE);		    /* Установить белый цвет вывода */
  rectangle(0, 0, 639, 349);	    /* Обвести рамку */
  setfillstyle(SOLID_FILL, YELLOW); /* Задать модель вывода */
  bar(0, 100, 639, 200);	    /* Нарисовать панель клавиатуры */
  setcolor(RED);		    /* Установить красный цвет */
  for (i = 2; i < 50; i++)	    /* Разметить "белые" клавиши */
    line(11+12*i, 100, 11+12*i, 200);
  setfillstyle(SOLID_FILL, BLACK);  /* Задать черный цвет */
  for (i = 0; i < 7; i++) {	    /* Разметить черные клавиши */
    if (i)
      bar( 7+84*i, 100, 15+84*i, 150);
    bar(31+84*i, 100, 39+84*i, 150);
    bar(43+84*i, 100, 51+84*i, 150);
    bar(67+84*i, 100, 75+84*i, 150);
    bar(79+84*i, 100, 87+84*i, 150);
    bar(91+84*i, 100, 99+84*i, 150);
  }
  setcolor(GREEN);		    /* Установить зеленый цвет */
  for (i = 0; i <= 7; i++)	    /* Разметить октавы */
    line(23+84*i, 100, 23+84*i, 200);
  play();			    /* Функция работы с мышью */
  closegraph();			    /* Закрыть графическую систему */
} /* main */

/***********************************@********************************/

void play(void)				/* Работа с мышью */
{
  int oct=0, oldoct=0;			/* Номер октавы, старая октава */
  unsigned note;			/* Частота текущей ноты */
  char buffer[5];			/* Буфер для выводимого текста */

  setfillstyle(SOLID_FILL, RED);	/* Задать модель вывода */
  bar(285, 40, 345, 70);		/* Нарисовать прямоугольник */
  setcolor(WHITE);			/* Установить белый цвет */
  settextstyle(TRIPLEX_FONT, HORIZ_DIR, 3);  /* Характеристики текста */
  outtextxy(290, 42, "QUIT");		/* Вывести текст */
  show_cursor();			/* Сделать курсор видимым */
  while ( 1 ) {				/* Бесконечный цикл */
    ioregs.r_bx = 0;			/* Инициализация */
    while (ioregs.r_bx == 0) {		/* Пока клавиша не нажата */
      read_cursor();		  /* Прочитать состояние курсора и мыши */
      /* Вывести координаты курсора на экран */
      printf("%3d %3d\r", ioregs.r_cx, ioregs.r_dx);
      /* Ограничения в области нижних и верхних частот */
      if (ioregs.r_cx > 24 && ioregs.r_cx < 613)
	oct = (ioregs.r_cx - 24) / 84 + 1;  /* Рассчитать номер октавы */
      if ( oldoct != oct ) {
	oct_freq(oct);			/* Рассчитать частоты нот октавы */
	itoa(notes[0], buffer, Radix);	/* Преобразовать целое в строку */
	setfillstyle(SOLID_FILL, RED);  	/* Установить цвет */
	settextstyle(DEFAULT_FONT, HORIZ_DIR, 1); /* Характеристики текста */
	hide_cursor();			/* Сделать курсор невидимым */
	bar(295, 80, 335, 95);		/* Прямоугольник */
	bar(295, 6, 316, 20);		/* Прямоугольник */
	setcolor(WHITE);     		/* Белый цвет */
	outtextxy(300, 85, buffer);	/* Вывести "До" текущей октавы */
	itoa(oct, buffer, Radix);   /* Преобразовать номер октавы в строку */
	outtextxy(302, 10, buffer);	/* Вывести номер октавы */
	show_cursor();			/* Сделать курсор видимым */
	oldoct = oct;			/* Сохранить номер октавы */
      }
    }
    if ( ioregs.r_bx == 1 ) {		/* Если нажата левая клавиша */

      /* Если курсор находится в области клавиатуры */
      if (ioregs.r_dx > 100 && ioregs.r_dx < 200) { 

	/* Ограничения в области нижних и верхних частот */
	if (ioregs.r_cx > 24 && ioregs.r_cx < 613) {

	  /* Привести горизонтальные координаты к эталонной октаве */
	  ioregs.r_cx = ioregs.r_cx - 24 - ( oct - 1 ) * 84;

	  /* Определение местоположения курсора и частоты текущего тона */

	  /* Для белых клавиш
	  */
	  if (ioregs.r_cx > 70 && ioregs.r_cx < 83)
	    note = notes[11];
	  else {
	    if (ioregs.r_cx > 59 && ioregs.r_cx < 70)
	      note = notes[9];
	    else {
	      if (ioregs.r_cx > 47 && ioregs.r_cx < 59)
		note = notes[7];
	      else {
		if (ioregs.r_cx > 35 && ioregs.r_cx < 47)
		  note = notes[5];
		else {
		  if (ioregs.r_cx > 23 && ioregs.r_cx < 35)
		    note = notes[4];
		  else {
		    if (ioregs.r_cx > 11 && ioregs.r_cx < 23)
		      note = notes[2];
		    else
		      if (ioregs.r_cx >  0 && ioregs.r_cx < 11)
			note = notes[0];
		  }
		}
	      }
	    }
	  }
	  if (ioregs.r_dx < 150) {	/* Для черных клавиш */
	    if (ioregs.r_cx >= 67 && ioregs.r_cx <= 75)
	      note = notes[10];
	    else {
	      if (ioregs.r_cx >= 55 && ioregs.r_cx <= 63)
		note = notes[8];
	      else {
		if (ioregs.r_cx >= 43 && ioregs.r_cx <= 51)
		  note = notes[6];
		else {
		  if (ioregs.r_cx >= 19 && ioregs.r_cx <= 27)
		    note = notes[3];
		  else
		    if (ioregs.r_cx >=  8 && ioregs.r_cx <= 14)
		      note = notes[1];
		}
	      }
	    }
	  } 
	  show_freq(note);	/* Вывести частоту тона на экран */
	  sound(note);		/* Включить звук */
	  delay(200);		/* Временная задержка */
	  nosound();		/* Выключить звук */
	}
      }
    }
    if ( ioregs.r_bx == 2 ) {		/* Нажата правая клавиша */
      if (ioregs.r_cx>285 && ioregs.r_dx>40 &&
		ioregs.r_cx<345 && ioregs.r_dx<70)
	return; 	/* Возврат, если курсор в области "Quit" */
    }
  }
} /* play */

/***********************************@********************************/

void oct_freq(int oct)			/* Расчет частот нот октавы */
{
  double f[12];				/* Частоты нот октавы oct */
  register int i;			/* Счетчик */

  f[0] = 32.75 * pow(2.0, oct-1);	/* Частота "До" */
  notes[0] = (unsigned)f[0];		/* Целая часть частоты */

  for (i = 1; i <= 11; i++) {		/* Частоты остальных нот октавы */
    f[i] = f[0] * pow(2.0, i/12.0);
    notes[i] = (unsigned)f[i];		/* Целая часть частоты */
  }
} /* oct_freq */

/***********************************@********************************/

void show_freq(int fr)			/* Вывести частоту тона на экран */
{
  char buffer[5];			      /* Буфер для текста */

  settextstyle(DEFAULT_FONT, HORIZ_DIR, 1);   /* Установить характеристики */
					      /* выводимого текста	   */
  itoa(fr, buffer, Radix);		      /* Преобразовать в строку */
  setfillstyle(SOLID_FILL, RED);	      /* Задать модель вывода */
  hide_cursor();			      /* Сделать курсор невидимым */
  bar(295, 205, 335, 220);		      /* Нарисовать прямоугольник */
  setcolor(WHITE);			      /* Цвет текста */
  outtextxy(300, 210, buffer);		      /* Вывести строку на экран */
  show_cursor();			      /* Сделать курсор видимым */
} /* show_freq */

/***********************************@********************************/

void hide_cursor(void)		/* Сделать курсор невидимым */
{
  ioregs.r_ax = 2;		/* Функция 2 "Сделать курсор невидимым */
  intr(0x33, &ioregs);		/* Прерывание 33h */
} /* hide_cursor */

/***************************************@******************************/

void init_graph(void)		   /* Инициализация графической системы */
{
  /* Графический драйвер, графический режим, код ошибки */
  int gdriver = EGA, gmode = EGAHI, errorcode;

  initgraph(&gdriver, &gmode, "D:\\TC\\BGI");	/* Инициализация системы */
  errorcode = graphresult();		/* Результат инициализации */
  if( errorcode != grOk ) {		/* Ошибка при инициализации */
    printf(" Graphics System Error: %s\n", grapherrormsg(errorcode));
    exit(1);				/* Выход из программы по ошибке */
  }
} /* init_graph */

/***************************************@************************/

int init_mouse(void)		/* Инициализация мыши */
{
  ioregs.r_ax = 0;		/* Функция 0 "Начальная установка */
				/*            драйвера мыши"      */
  intr(0x33, &ioregs);		/* Прерывание 33h */
  if ( ioregs.r_ax == 0 ) {	/* Если AX = 0, то выход */
    printf("MOUSE NOT INSTALLED ! PRESS ANY KEY !\n");
    getch();			/* Подождать нажатия клавиши */
    closegraph();		/* Закрыть графическую систему */
    exit(1);			/* Закончить работу программы */
  }
  return 0;			/* Возврат, если драйвер установлен */
} /* init_mouse */

/***********************************@********************************/

void set_cursor_position(void)	/* Установить курсор в заданную позицию */
{
  ioregs.r_ax = 4;		/* Функция 4 "Установить курсор в */
  				/*    заданную позицию на экране" */
  ioregs.r_cx = 315;		/* Горизонтальная координата курсора */
  ioregs.r_dx = 160;		/* Вертикальная координата курсора */
  intr(0x33, &ioregs);		/* Прерывание 33h */
} /* set_cursor_position */

/***********************************@********************************/

void set_mickey_pixel(void)	/* Установить соотношение микки-пиксел */
{
  ioregs.r_ax = 15;		/* Функция 15 "Установить соотношение */
  				/*             микки-пиксел"          */
  ioregs.r_cx = 36;		/* 36/8 по горизонтали */
  ioregs.r_dx = 36;		/* 36/8 по вертикали */
  intr(0x33, &ioregs);		/* Прерывание 33h */
} /* set_mickey_pixel */

/***********************************@********************************/

void set_cursor_shape(void)		/* Задать параметры курсора */
{
  unsigned int cursor[2][16];		/* Массив масок экрана и курсора */
  unsigned far *fpuns;			/* FAR указатель на массив */
  unsigned far **pfpuns;		/* Указатель на предыдущее */

/* Содержимое масок курсора и экрана
*/
  cursor[1][0]  = 0x0001;  /*    0000000000000001   */
  cursor[1][1]  = 0x0002;  /*    0000000000000010   */
  cursor[1][2]  = 0x000e;  /*    0000000000001110   */
  cursor[1][3]  = 0x003c;  /*    0000000000111100   */
  cursor[1][4]  = 0x00fc;  /*    0000000011111100   */
  cursor[1][5]  = 0x03f8;  /*    0000001111111000   */
  cursor[1][6]  = 0x0ff8;  /*    0000111111111000   */
  cursor[1][7]  = 0x3ff0;  /*    0011111111110000   */
  cursor[1][8]  = 0xfff0;  /*    1111111111110000   */
  cursor[1][9]  = 0x3fe0;  /*    0011111111100000   */
  cursor[1][10] = 0x1fe0;  /*    0001111111100000   */
  cursor[1][11] = 0x3fc0;  /*    0011111111000000   */
  cursor[1][12] = 0x78c0;  /*    0111100011000000   */
  cursor[1][13] = 0xf000;  /*    1111000000000000   */
  cursor[1][14] = 0xe000;  /*    1110000000000000   */
  cursor[1][15] = 0xc000;  /*    1100000000000000   */

  cursor[0][0]  = 0xfffc;  /*    1111111111111100   */
  cursor[0][1]  = 0xfff8;  /*    1111111111111000   */
  cursor[0][2]  = 0xffe0;  /*    1111111111100000   */
  cursor[0][3]  = 0xff81;  /*    1111111110000001   */
  cursor[0][4]  = 0xfe01;  /*    1111111000000001   */
  cursor[0][5]  = 0xf803;  /*    1111100000000011   */
  cursor[0][6]  = 0xe003;  /*    1110000000000011   */
  cursor[0][7]  = 0x8007;  /*    1000000000000111   */
  cursor[0][8]  = 0x0007;  /*    0000000000000111   */
  cursor[0][9]  = 0x800f;  /*    1000000000001111   */
  cursor[0][10] = 0xc00f;  /*    1100000000001111   */
  cursor[0][11] = 0x801f;  /*    1000000000011111   */
  cursor[0][12] = 0x021f;  /*    0000001000011111   */
  cursor[0][13] = 0x07ff;  /*    0000011111111111   */
  cursor[0][14] = 0x0fff;  /*    0000111111111111   */
  cursor[0][15] = 0x1fff;  /*    0001111111111111   */

  ioregs.r_ax = 9;		/* Функция 9 "Задать параметры */
  				/*       графического курсора" */
  ioregs.r_bx = 16;		/* Горизонтальная координата горячего пятна */
  ioregs.r_cx = 0;		/* Вертикальная координата горячего пятна */

  fpuns = (unsigned far *)cursor;	/* Вычислить FAR адрес массива */
  pfpuns = &fpuns;			/* Указатель на FAR адрес массива */

  ioregs.r_es = *((unsigned *)pfpuns + 1);	/* Адрес сегмента в ES */
  ioregs.r_dx = *(unsigned *)pfpuns;		/* Смещение в DX */

  intr(0x33, &ioregs);		/* Прерывание 33h */
} /* set_cursor_shape */

/***********************************@********************************/

void show_cursor(void)		/* Сделать курсор видимым */
{
  ioregs.r_ax = 1;		/* Функция 1 "Сделать курсор видимым" */
  intr(0x33, &ioregs);		/* Прерывание 33h */
} /* show_cursor */

/***********************************@********************************/

void read_cursor(void)		/* Определить местоположение курсора */
{				/* и состояние клавиш		     */
  ioregs.r_ax = 3;		/* Функция 3 */
  intr(0x33, &ioregs);		/* Прерывание 33h */
}
