                 Министерство гражданской авиации

          Киевский институт инженеров гражданской авиации

                          Авиацентр НТТМ








                   ПРИГЛАСИТЕЛЬНЫЙ БИЛЕТ И ПРОГРАММА

          ПЕРВОЙ ВСЕСОЮЗНОЙ НАУЧНО-ТЕХНИЧЕСКОЙ КОНФЕРЕНЦИИ


         "Методы и средства защиты от компьютерных вирусов

                  в операционной системе MS DOS"



                       14-17 ноября 1990 г.
                              г.Киев













                          Киев-КИИГА 1990
.
                             - 2 -
Уважаемый товарищ  ____________________________________________

     Приглашаем Вас  принять участие в работе конференции "Методы
и средства защиты от компьютерных вирусов в  операционной системе
MS  DOS.  Если Ваш доклад или сообщение,  не включены в программу
конференции,  убедительно просим подготовить стендовое  сообщение
на  стандартном листе ватмана с тем,  чтобы участники конференции
могли ознакомиться с Вашей разработкой или подходом.
     Конференция будет проходить в корп.  1  Киевского  института
инженеров гражданской авиации (проспект Комарова 1).
     Заезд участников 13 ноября. Участников, не выславших в адрес
Оргкомитета копию платежного поручения,  просьба иметь  при  себе
заверенную копию. 13 ноября регистрация и поселение с 10-00 до
23-00 в корп.  3,  ауд. 3-302. Прибывших после 23-00 просим обра-
щаться  по тел.  484-80-16 Ткаченко Галине Эросовне или 484-90-40
Камышину Владимиру Викторовичу.  14 ноября регистрация участников
с  9-00  до 10-00 в вестибюле корп.1.  Не гарантируется поселение
участников,  с опозданием перечисливших вступительный взнос (пос-
ледние обязательно должны иметь на руках заверенную копию платеж-
ного поручения).
     Проезд: от  аэропорта "Борисполь" - автобусом "Экспресс" до
конечной остановки ("Площадь Победы"),  затем трамваем 1 или 3 до
остановки  "Гарматная";  от  аэропорта "Киев" - троллейбусом 9 до
остановки "Севастопольская площадь",  затем автобусом 69 до оста-
новки  "Гарматная";  от железнодорожного вокзала - трамваем 2 или
13 до ост.  "Площадь Победы",  затем трамваем  1,3  до  остановки
"Гарматная".  Остановка  "Гарматная"  расположена  прямо напротив
корпусов КИИГА.  Оргкомитет не гарантирует приобретение  обратных
билетов, поэтому рекомендуется приобрести их заблаговременно.

                                                       Оргкомитет

                          БЛАГОДАРНОСТИ

     Ряд организаций  содействовал проведению конференции, оказав
финансовую помощь Оргкомитету или  установив  специальные  премии
для  участников конкурса.  От имени Оргкомитета выражаю благодар-
ность Сергею Григорьевичу Антимонову - директору  Научного центра
СП "Диалог" при ВЦ АН СССР,  Григорию Евгеньевичу Попову - дирек-
тору Киевского филиала СП "Новинтех", Геннадию Павловичу Тарасову
- директору ЦНКБ ВT ГКВТИ CCCР, Анатолию Абовичу Эйдесу - руково-
дителю издательского отдела СП "Интерюнити".

Председатель Оргкомитета конференции                Н.Н. Безруков
.
                             - 3 -
                     ОРГКОМИТЕТ КОНФЕРЕНЦИИ


Председатель оргкомитета:                         Безруков Н.Н.

Зам.председателя,
зам. директора Авиацентра НТТМ:                   Белоусов А.Ф.

Секретарь:                                        Ткаченко Г.Э.

Члены оргкомитета:  Камышин В.В.,Кучма Е.E.,Лященко Ю.П.

   Адрес оргкомитета: 252058 Киев-58, пр. Космонавта Комарова 1,
КИИГА, корп. 3, Авиацентр НТТМ, тел. 484-94-63

                          ЖЮРИ КОНКУРСА

Председатель жюри: Безруков  Н.Н.
Секретарь:         Литвинов  Б.Ю.
Члены жюри: Быков В.Л.,Дрозд Ю.Ю.,Кононенко А.В.,Кохманюк  Д.Н.,
            Тарасов Г.П., Ткаченко В.О, Третьяков А.И.

Тел. (044) 268-10-26 Безруков Николай Николаевич,
     (044) 441-92-60, (044) 413-89-74 (дом) Литвинов Борис Юрьевич

      ЖЮРИ СПЕЦИАЛЬНОЙ ПРЕМИИ КИЕВСКОГО ФИЛИАЛА СП НОВИНТЕХ

Председатель жюри:  Безруков    Н.Н.
Секретарь:          Конозенко   В.И.
Члены жюри:         Загоровский В.Г., Кохманюк Д.Н.,Русаков А.Э.

Тел. (044) 268-10-26 Безруков Николай Николаевич
     (044) 266-53-88 Конозенко Владимир Иванович

         ЖЮРИ СПЕЦИАЛЬНОЙ ПРЕМИИ ЖУРНАЛА ИНТЕРКОМПЬЮТЕР

Председатель жюри:  Эйдес А.А.
Секретарь:          Карасик И.Ш.
Члены жюри:         Безруков Н.Н., Литвинов Б.Ю., Ткаченко В.О.
Тел. (095) 202-92-80 Эйдес Анатолий Абович
     (095) 202-92-80 Карасик Иосиф Шевелевич
.
                             - 4 -
          Открытие конференции  14 ноября (10.30-13.00)

     Безруков Н.Н.(Киев).  Актуальные проблемы компьютерной виру-
сологии (стелс-вирусы, файлово-бутовые вирусы, LAN-вирусы).

     Бончев В.(София).  Развитие вирусологии в Болгарии (название
ориентировочное и может быть уточнено).

     Лозинский Д.Н.(Москва). Aidstest: первые два года.

     Тарасов Г.П.(Киев, ЦНКБ ВТ ГКВТИ). Государственная программа
в  области  защиты  программного обеспечения от вирусов (название
ориентировочное и может быть уточнено).


           Вечернее заседание 14 ноября (15.00-19.00)
     Секция 1: Общие проблемы компьютерной вирусологии. Классифи-
кация  вирусов и методы анализа вирусоподобных программ,  инстру-
ментальные средства вирусолога  (руководитель  секции  Н.Н.Безру-
ков).

     Водяник А.Г.(Мариуполь). Некоторые утилиты для анализа прог-
раммного обеспечения.

     Волынский В.В.(Москва).  Использование Periscope для анализа
программного обеспечения.

     Карасик И.Ш.(Москва). Вирусы как продукт естественной эволю-
ции программного обеспечения.

     Кохманюк Д.С.(Киев).  Опыт использования Quaid Analizer  для
исследования программного обеспечения.

     Свиридов И.А.(Киев). Роль BBS в борьбе с вирусами (на примере
электронной конференции по вирусам FIDO).

     Селивоненко А.Б.(Полтава). Шпион 21 прерывания.

     Касперский Е.В.(Москва).  Методика  работы  с дизассемблером
Sourcer.

     Цал М.И.(Ленинград). Современный уровень написания вирусов и
возможность создания универсального детектора и резидентных прог-
рамм.
.
                             - 5 -
             Утреннее заседание 15 ноября (10.00-13.00)
     Секция 2: Интегрированные антивирусные системы. Полифаги.
               (руководитель секции Д.Н.Лозинский).

     Грязнов Д.О.(Переславль-Залесский).  Антивирусная система PC
Shield.

     Касперский Е.Н.(Москва). Полифаг -V.

     Котик О.Г.(Москва). Система Anti-Kot/Anti-Kor.

     Свиридов И.А.(Киев). Пакетный универсальный детектор-фаг для
бутовых вирусов.

     Сербиненко А.В.(Донецк).  Сравнительный анализ пользователь-
ского интерфейса в полифагах.

     Сусликов Е.Н.(Кемерово). Незаражаемый высокоскоростной поли-
фаг с самонастройкой на детектирование новых вирусов.

     Сысоев И.В.(Москва). Полифаг AV.

     Юдин Г.Т.,  Биллиг И.В.(Тверь). Интегрированная антивирусная
среда Авиценна.


           Вечернее заседание 15 ноября (15.00-19.00)

     Секция 3:  Вопросы конструирования детекторов, конструирова-
ние ревизоров,  контроль целостности MS DOS (руководитель  секции
Е.В.Касперский).

     Ветров И.В.(Москва).  Пакет программ "Ревизор".

     Герасимов В.В.(Москва). Новая версия ревизора DLI.

     Мостовой Д.Ю. (Москва). Некоторые аспекты реализации ревизо-
ров.

     Рабец В.С.(Черноголовка). Детектор, интегрированный с Norton
Commander.

     Румянцев М.И.(Донецк). Spirit - средство контроля целостнос-
ти MS DOS.

     Суворов И.А.(Киев). Полидетектор с ускоренным поиском сигна-
тур и возможностью ввода данных из таблиц "Компьютерной вирусоло-
гии".
.
                             - 6 -
     Судленков Г.О.(Минск).  Ревизор с возможностью нейтрализации
файловых вирусов, дописывающихся в хвост файла.

     Шеховцов А.Л.(Киев). Полидетектор с диалоговым интерфейсом и
возможностью ввода сигнатур для контекстного поиска.


          Утреннее заседание 16 ноября (9.00 - 13.00)
     Секция 4: Конструирование резидентных программ защиты, мето-
ды контроля "on the fly" (руководитель А.Г.Водяник).

     Водяник А.Г.(Мариуполь).  Intellectual Writе Protector - гиб-
кое сочетание аппаратных и программных методов защиты.

     Двоеглазов И.М.(Киев). Резидентный сторож, контролирующий 21
прерывание.

     Касперский Е.Н.(Москва). Резидентные сторожа -D1, -D2, -D3.

     Катюшкин А.В.(Москва).  Резидентный монитор  с  расширенными
возможностями.

     Пономаренко В.В.(Киев). Резидентная поливакцина.


          Вечернее заседание 16 ноября (15.00 - 19.00)
     Секция 5. Нетрадиционные методы защиты от вирусов, незаража-
емые и самоизлечивающиеся программы (руководитель  Н.Н.Безруков).

     Бабанин В.М.(Тверь).  Универсальная антивирусная вакцина  от
файловых вирусов, имплантирующихся в конец файла.

     Волынский В.В.(Москва). Вирус против вирусов.

     Сесса А.В.  (Днепропетровск). Нейтрализация произвольных бу-
товых вирусов при загрузке ДОС.

     Сусликов Е.Н.(Кемерово). Эвристические  методы поиска новых
вирусов в незаражаемом полидетекторе LD.

     Рахимов А.Р., Турсунов О.О.(Газалкент). Антивирусная система
Cerber.

     Фиалков А.В.(Москва). Универсальное вакцинирование программ
от файловых вирусов присоединяемым детектором-защитником.

     Д и с к у с с и я: "Меры воздействия и  возможные  санкции
против  разработчиков  и распространителей вирусов"
.
                             - 7 -
          Утреннее заседание 17 ноября (10.00 - 12.00)
     Секция 6:  Методы и алгоритмы защиты от несанкционированного
копирования коммерческого ПО (руководитель секции В.Герасимов).

     Даен И.Л.,  Маковенко А.Т.(Киев). Средства защиты от копиро-
вания данных, основанные на применениии ключей.

     Герасимов В.В.(Москва).  Классификация систем защиты от  не-
санкционированного  копирования  и  некоторые оценки сложности их
вскрытия.

     Рик А.В.(Тверь).   Метод   комплексной   защиты  программных
средств на дискетах и винчестерах.


              Закрытие конференции (12.00 - 14.00)

     Безруков Н.Н.  Итоги  конкурса антивирусных программ,  расп-
ространяемых бесплатно. Награждение победителей.
     Принятие заключительных документов,  определение даты прове-
дения следующей конференции.

