@echo off
: ***************************************************************************
: *     Вызов справочника телефонов     К.Е.Г. 17.07.91-20.11  для ME-5     *
: ***************************************************************************
:----------- Запомнить текущий идентификатор ME  -----------
SET K_ME_ID=%ME_ID%
:------- Установить: идент. ME = TEL для вызова вместо INIT - TELINIT.MAC ---
:-- Механизм:через STARTUP.MAC (мой по ME_ID вызов -> %ME_ID%INIT.MAC )
SET ME_ID=TEL
D:\ME50\ME /Д-  /Ф-k_phone.db
:------- Восстановить: идентификатор ME, диск и оглавление ВЫЗОВА ------------
SET ME_ID=%K_ME_ID%
SET K_ME_ID=
mode co80
