АБВГДЕЖЗИЙКЛМНОП  1АБВГДЕЖЗИЙКЛМНОП
РСТУФХЦЧШЩЪЫЬЭЮЯ  1РСТУФХЦЧШЩЪЫЬЭЮЯ
абвгдежзийклмноп  1абвгдежзийклмноп
░▒▓│┤╡╢╖╕╣║╗╝╜╛┐  1░▒▓│┤╡╢╖╕╣║╗╝╜╛┐
└┴┬├─┼╞╟╚╔╩╦╠═╬╧  1└┴┬├─┼╞╟╚╔╩╦╠═╬╧
╨╤╥╙╘╒╓╫╪┘┌█▄▌▐▀  1╨╤╥╙╘╒╓╫╪┘┌█▄▌▐▀
рстуфхцчшщъыьэюя  1рстуфхцчшщъыьэюя
ЁёҐґЄєІіЇї·√№¤■   1ЁёҐґЄєІіЇї·√№¤■ 

 2АБВГДЕЖЗИЙКЛМНОП 0
 2РСТУФХЦЧШЩЪЫЬЭЮЯ 0
 2абвгдежзийклмноп 0
 2░▒▓│┤╡╢╖╕╣║╗╝╜╛┐ 0
 2└┴┬├─┼╞╟╚╔╩╦╠═╬╧ 0
 2╨╤╥╙╘╒╓╫╪┘┌█▄▌▐▀ 0
 2рстуфхцчшщъыьэюя 0
 2ЁёҐґЄєІіЇї·√№¤■ 

   3АБВГДЕЖЗИЙКЛМНОП 0
   3РСТУФХЦЧШЩЪЫЬЭЮЯ 0
   3абвгдежзийклмноп 0
   3░▒▓│┤╡╢╖╕╣║╗╝╜╛┐ 0
   3└┴┬├─┼╞╟╚╔╩╦╠═╬╧ 0
   3╨╤╥╙╘╒╓╫╪┘┌█▄▌▐▀ 0
   3рстуфхцчшщъыьэюя 0
   3ЁёҐґЄєІіЇї·√№¤■ 
