@echo off
: ***************************************************************************
: *     Вызов справочника телефонов     К.Е.Г. 25.09.90                     *
: *1. Вызов без параметров - справочник <ME.PATH>\PHONE.DB                  *
: *2. С параметром - [ПУТЬ]ИМЯ[.EXT]                                        *
: *                       Если путь не указан  -то из текущего директория   *
: *                       Если EXT  не указано -то умолчание - .DB          *
: ***************************************************************************
:------- Запомнить текущие: идентификатор ME , диск и оглавление -----------
SET K_ME_ID=%ME_ID%
what ye
set k_drive=%what%
what y
set k_path=%what%
:------- Установить: идент. ME = TEL  (для использования TELINIT.MAC) ----
SET ME_ID=TEL
me_4 /R telstart /Д-%k_drive%:%k_path%  /Ф-PHONE.DB
:------- Восстановить: идентификатор ME, диск и оглавление ВЫЗОВА ------------
SET ME_ID=%K_ME_ID%
: Это уже не обязательно, вроде ничего не портили
%k_drive%:
cd %k_path%