/* fond.c
  ======================

  this programm calculate
  and put to screen the
  some string and number

  ======================
*/

  int  Ppn, 	/* процент подоходного нал.= 25% */
       Pst, 	/* процент страхования      = 7% */
       Pn, 	/* процент накоплений      = 30% */
       Pot,	/* процент оплаты труда     = 80% */
       Ppr;	/* процент премии           = 20% */
  int  F;	/* фонд общий        */
main()
{ 
  int St,	/* сумма страхования */
      Spn,	/* сумма подоходного налога */
      Spk,	/* сумма плановых накоплений */
      Fpt,	/* фонд оплаты труда */
      Fpr;	/* фонд премий */

F=13000;
outsym("общий фонд  ",240,95);
outnum(F,280,95);
/*============*/
Ppn=25;
Spn=F/100*Ppn;
outsym(" подоходный налог ",320,95);
outnum(Spn,360,95);
/*============*/
Pst=7;
St=(F-Spn)/100*Pst;
outsym(" сумма страхования ",400,95);
outnum(St,440,95);
/*============*/
Pn=30;
Spk=(F-Spn-St)/100*Pn;
outsym(" сумма плановых накоплений ",480,95);
outnum(Spk,520,95);
/*============*/
Pot=80;
Fpt=(F-Spn-St-Spk)/100*Pot;
outsym(" фонд оплаты труда ",560,95);
outnum(Fpt,600,95);
/*============*/
Ppr=20;
Fpr=(F-Spn-St-Spk)/100*Ppr;
outsym(" сумма плановых накоплений ",640,95);
outnum(Fpr,680,95);
/*============*/
outsym(" сумма  ",800,95);
outnum(Spn+St+Spk+Fpt+Fpr,840,95);
exit();
} 
#include st.inc
#include disp.inc


