
         {------------------------------------------------------}
         {    Модуль SaveDS  V 1.0  пакета   TURBO SUPPORT      }
         {     Язык программирования Turbo Pascal  V 6.0        }
         {------------------------------------------------------}
         { Дата создания: 29/09/1992    (  V 1.0  )             }
         { Дата последних изменений :  29/09/1992               }
         {------------------------------------------------------}
         { Модуль определяет процедуры переустановки сегмента   }
         {  данных DS для построения резидентных программ и     }
         {     независимых процедур обработки прерываний        }
         {------------------------------------------------------}
         { (c) 1992 Ярослав Мигач                               }
         {------------------------------------------------------}

UNIT SaveDs;

{================= Ключи компиляции  ======================}

{$IFDEF DEBUGSAVEDS}
      {$D+,L+,R+,S+}
{$ELSE}
      {$D-,L-,R-,S-}
{$ENDIF}

{$F+,O+,A+,X+,I-,V-,B-}

{$L SAVEDS }

{==========================================================}

INTERFACE

PROCEDURE InitDs;
PROCEDURE SetDs;

IMPLEMENTATION

PROCEDURE InitDs; EXTERNAL;
PROCEDURE SetDs; EXTERNAL;

BEGIN
     InitDs

END.
