
;------------------------------------------------
; Модуль сохранения/ восстановления сегмента DS
;        для резидентных программ
;------------------------------------------------
; Язык программирования :
; Macro Assembler V 5.1
;------------------------------------------------
; Дата последних изменений
; 29.09.1992
;------------------------------------------------
; (c) 1992, Мигач Ярослав
;------------------------------------------------


CODE    SEGMENT PUBLIC

        ASSUME  CS : CODE

SAVEDS    DW      ?    ; Значение сегмента DS устанавливаемое
                       ; подпрограммой инициализации

        PUBLIC  InitDs
        PUBLIC  SetDs


        ; Начальная инициализация сегмета DS

INITDS  PROC    FAR

        PUSH    AX
        MOV     AX, DS
        MOV     SAVEDS, AX

        POP     AX
        RET

INITDS  ENDP

        ; Установка требуемого сегмента DS

SETDS   PROC    FAR

        PUSH    AX
        MOV     AX, SAVEDS
        MOV     DS, AX

        POP     AX
        RET

SETDS   ENDP

CODE    ENDS

        END
