#include <stdio.h>
#include <conio.h>
#include <memory.h>

void main (void);
void Check_res_part (void);

char  * m1 [] =
   {
     /*  0 */ "FALL_LETTERS",
     /*  1 */ "DOS-62",
     /*  2 */ "\n",
     /*  3 */ "",
     /*  4 */ "21H",
     /*  5 */ "28H",
     /*  6 */ "1CH",
     /*  7 */ "\t",
     /*  8 */ "YANSHORT",
     /*  9 */ "FRIDAY/SUNDAY",
     /* 10 */ "08H",
     /* 11 */ "BALL",
     /* 12 */ "13H",
     /* 13 */ "CANCER",
     /* 14 */ "SELF_MODIFY",
     /* 15 */ "YANKEE_DOODLE",
     /* 16 */ "VACSINE",
     /* 17 */ "EDDIE",
     /* 18 */ "27H",
     /* 19 */ "DISK_KILLER",
     /* 20 */ "STONED",
     /* 21 */ "IBM",
     /* 22 */ "MICRO88",
     /* 23 */ "JOSHI",
     /* 24 */ "SVC",
     /* 25 */ "BEBE",
     /* 26 */ "INFORM",
     /* 27 */ "C-644",
     /* 28 */ "MGTU",
     /* 29 */ "ATTENTION",
     /* 30 */ "MIRROR",
     /* 31 */ "MIRROR-2",
     /* 32 */ "RC-707",
     /* 33 */ "PETERBURG",
     /* 34 */ "sURIV-1",
     /* 35 */ "100-YEAR",
     /* 36 */ "RE-905",
     /* 37 */ "ALABAMA",
     /* 38 */ "VORONEZH-1",
     /* 39 */ "VORONEZH-2",
     /* 40 */ "RC-516",
     /* 41 */ "STELS (!)",
     /* 42 */ "sURIV-2",
     /* 43 */ "JOKER-1",
     /* 44 */ "----"
   };
void main ()
{
Check_res_part ();
return;
}

/***************************************************************************/
/*
 *   Функция быстрого поиска последовательности Shablon из LgSha
 *   символов в буфере Buffer размером LgBuf символов с использо-
 *   ванием алгоритма Boyer R.S. & Moore J.S.
 */

unsigned int search_BM (unsigned int LgSha,unsigned char * Shablon,
                        unsigned int LgBuf,unsigned char * Buffer)
{
register unsigned int i,k;
register int j;
unsigned int sym;
int table [256];

if (LgSha>LgBuf || LgSha<=2) return (0);
j = LgSha;
for (i=0; i<256; i++) table [i] = j; /* Забиваем таблицу размером шаблона */
k = j - 2;
for (i=0; i<k; i++)
   {
   sym = ~(Shablon [i]) & 0xFF;      /* Дешифровка символа шаблона <----- */
   table [sym] = j - i - 1;          /* В элемент, индексируемый символом */
   }                                 /* заносим смещение символа от конца */
i=LgSha;                             /* шаблона                           */
do {
   j=LgSha; k=i;                     /* i - текущий указатель в массиве   */
   do { j--; k--; if (j<0) break; }  /* сравниваем, пока совпадает <----- */
   while ( (~(Shablon [j]) & 0xFF) == Buffer [k]);
   if (j<0) break;
   i += table [Buffer [i-1]];        /* Сдвигаем шаблон так,чтобы текущий */
   }                                 /* символ массива смотрел на тот же  */
while (i<LgBuf);                     /* символ шаблона (если он есть)     */
if (j>=0) i = 0;
else      i = 1;
return (i);
}

/***************************************************************************/

static int NumCon,far * RAM = (int far *) 0x413;
static unsigned int l,part,my_ram,offp;
static unsigned char * Buffer, sym, * cont; 

static union CHADR
   {
   struct {
          unsigned int off;
          unsigned int seg;
          } w;
   unsigned char far * ptr;
   } point;

static struct TABLE
   {
   int count_con;     /* количество шаблонов с данной буквой    */
   int shift;         /* минимальное смещение в списке шаблонов */
   int num_con [14];  /* перечень шаблонов с данной буквой      */
   }   * cur_table,
       Tables [256]=
      {
/* 00 */ {4,13,{1,11,13,18}},
/* 01 */ {9,1,{0,3,5,10,10,13,14,15,24}},
/* 02 */ {5,3,{1,2,3,14,19}},
/* 03 */ {4,2,{8,18,20,21}},
/* 04 */ {5,4,{2,9,17,19,24}},
/* 05 */ {1,6,{16}},
/* 06 */ {14,2,{0,1,3,4,5,6,8,9,11,12,16,20,21,22}},
/* 07 */ {8,2,{0,6,7,8,9,16,17,17}},
/* 08 */ {4,9,{1,14,16,23}},
/* 09 */ {0,16,{0}},
/* 0A */ {2,1,{2,23}},
/* 0B */ {1,13,{23}},
/* 0C */ {0,16,{0}},
/* 0D */ {2,3,{6,15}},
/* 0E */ {7,1,{0,2,3,7,7,16,17}},
/* 0F */ {0,16,{0}},
/* 10 */ {1,11,{5}},
/* 11 */ {1,1,{21}},
/* 12 */ {1,4,{2}},
/* 13 */ {2,6,{7,18}},
/* 14 */ {0,16,{0}},
/* 15 */ {3,8,{10,11,15}},
/* 16 */ {0,16,{0}},
/* 17 */ {1,9,{2}},
/* 18 */ {0,16,{0}},
/* 19 */ {3,1,{10,22,24}},
/* 1A */ {0,16,{0}},
/* 1B */ {0,16,{0}},
/* 1C */ {0,16,{0}},
/* 1D */ {0,16,{0}},
/* 1E */ {11,1,{0,1,2,3,4,6,8,10,11,12,17}},
/* 1F */ {5,1,{0,3,6,7,22}},
/* 20 */ {1,4,{19}},
/* 21 */ {1,2,{20}},
/* 22 */ {0,16,{0}},
/* 23 */ {0,16,{0}},
/* 24 */ {1,3,{9}},
/* 25 */ {1,1,{20}},
/* 26 */ {2,2,{9,22}},
/* 27 */ {0,16,{0}},
/* 28 */ {2,1,{18,20}},
/* 29 */ {0,16,{0}},
/* 2A */ {0,16,{0}},
/* 2B */ {0,16,{0}},
/* 2C */ {0,16,{0}},
/* 2D */ {0,16,{0}},
/* 2E */ {6,2,{3,5,7,10,13,19}},
/* 2F */ {0,16,{0}},
/* 30 */ {2,5,{13,17}},
/* 31 */ {0,16,{0}},
/* 32 */ {0,16,{0}},
/* 33 */ {7,1,{9,12,13,15,16,22,24}},
/* 34 */ {0,16,{0}},
/* 35 */ {0,16,{0}},
/* 36 */ {1,13,{10}},
/* 37 */ {1,7,{5}},
/* 38 */ {0,16,{0}},
/* 39 */ {0,16,{0}},
/* 3A */ {1,16,{8}},
/* 3B */ {2,3,{1,10}},
/* 3C */ {1,11,{1}},
/* 3D */ {6,3,{10,11,14,14,18,20}},
/* 3E */ {1,14,{1}},
/* 3F */ {2,3,{4,15}},
/* 40 */ {3,1,{9,9,15}},
/* 41 */ {0,16,{0}},
/* 42 */ {1,12,{12}},
/* 43 */ {0,16,{0}},
/* 44 */ {0,16,{0}},
/* 45 */ {1,12,{10}},
/* 46 */ {1,16,{24}},
/* 47 */ {1,14,{19}},
/* 48 */ {0,16,{0}},
/* 49 */ {0,16,{0}},
/* 4A */ {0,16,{0}},
/* 4B */ {3,4,{5,6,8}},
/* 4C */ {1,13,{11}},
/* 4D */ {0,16,{0}},
/* 4E */ {0,16,{0}},
/* 4F */ {0,16,{0}},
/* 50 */ {8,3,{0,1,2,4,6,9,11,12}},
/* 51 */ {6,6,{0,4,6,8,11,12}},
/* 52 */ {6,2,{0,4,6,8,11,12}},
/* 53 */ {6,3,{0,3,4,6,11,23}},
/* 54 */ {0,16,{0}},
/* 55 */ {5,3,{4,5,8,20,21}},
/* 56 */ {5,2,{4,6,8,11,17}},
/* 57 */ {5,3,{4,6,8,11,12}},
/* 58 */ {4,8,{7,11,12,13}},
/* 59 */ {1,10,{7}},
/* 5A */ {2,4,{7,22}},
/* 5B */ {1,11,{7}},
/* 5C */ {0,16,{0}},
/* 5D */ {2,8,{20,21}},
/* 5E */ {2,7,{6,7}},
/* 5F */ {1,8,{7}},
/* 60 */ {0,16,{0}},
/* 61 */ {0,16,{0}},
/* 62 */ {0,16,{0}},
/* 63 */ {0,16,{0}},
/* 64 */ {0,16,{0}},
/* 65 */ {0,16,{0}},
/* 66 */ {1,5,{24}},
/* 67 */ {0,16,{0}},
/* 68 */ {0,16,{0}},
/* 69 */ {0,16,{0}},
/* 6A */ {0,16,{0}},
/* 6B */ {0,16,{0}},
/* 6C */ {1,5,{9}},
/* 6D */ {0,16,{0}},
/* 6E */ {0,16,{0}},
/* 6F */ {0,16,{0}},
/* 70 */ {0,16,{0}},
/* 71 */ {1,2,{24}},
/* 72 */ {2,3,{2,24}},
/* 73 */ {1,5,{2}},
/* 74 */ {8,1,{4,5,6,8,15,18,20,21}},
/* 75 */ {7,1,{0,1,2,9,10,11,14}},
/* 76 */ {2,11,{20,21}},
/* 77 */ {0,16,{0}},
/* 78 */ {0,16,{0}},
/* 79 */ {0,16,{0}},
/* 7A */ {0,16,{0}},
/* 7B */ {0,16,{0}},
/* 7C */ {2,4,{3,3}},
/* 7D */ {2,2,{0,24}},
/* 7E */ {0,16,{0}},
/* 7F */ {0,16,{0}},
/* 80 */ {8,1,{2,4,5,6,8,15,18,21}},
/* 81 */ {1,8,{14}},
/* 82 */ {0,16,{0}},
/* 83 */ {3,3,{16,17,19}},
/* 84 */ {0,16,{0}},
/* 85 */ {0,16,{0}},
/* 86 */ {0,16,{0}},
/* 87 */ {0,16,{0}},
/* 88 */ {1,15,{19}},
/* 89 */ {0,16,{0}},
/* 8A */ {3,3,{3,12,15}},
/* 8B */ {6,3,{12,15,17,19,20,21}},
/* 8C */ {1,12,{16}},
/* 8D */ {1,7,{1}},
/* 8E */ {4,4,{9,15,16,22}},
/* 8F */ {0,16,{0}},
/* 90 */ {3,7,{18,22,24}},
/* 91 */ {0,16,{0}},
/* 92 */ {0,16,{0}},
/* 93 */ {0,16,{0}},
/* 94 */ {0,16,{0}},
/* 95 */ {0,16,{0}},
/* 96 */ {0,16,{0}},
/* 97 */ {0,16,{0}},
/* 98 */ {0,16,{0}},
/* 99 */ {0,16,{0}},
/* 9A */ {1,8,{23}},
/* 9B */ {0,16,{0}},
/* 9C */ {4,7,{11,14,20,21}},
/* 9D */ {3,9,{20,21,22}},
/* 9E */ {0,16,{0}},
/* 9F */ {0,16,{0}},
/* A0 */ {1,6,{9}},
/* A1 */ {0,16,{0}},
/* A2 */ {0,16,{0}},
/* A3 */ {1,6,{13}},
/* A4 */ {1,2,{13}},
/* A5 */ {0,16,{0}},
/* A6 */ {0,16,{0}},
/* A7 */ {0,16,{0}},
/* A8 */ {0,16,{0}},
/* A9 */ {0,16,{0}},
/* AA */ {1,4,{5}},
/* AB */ {0,16,{0}},
/* AC */ {0,16,{0}},
/* AD */ {0,16,{0}},
/* AE */ {1,8,{17}},
/* AF */ {0,16,{0}},
/* B0 */ {2,5,{3,4}},
/* B1 */ {1,10,{19}},
/* B2 */ {0,16,{0}},
/* B3 */ {0,16,{0}},
/* B4 */ {2,2,{3,23}},
/* B5 */ {0,16,{0}},
/* B6 */ {0,16,{0}},
/* B7 */ {0,16,{0}},
/* B8 */ {3,15,{1,13,18}},
/* B9 */ {1,10,{24}},
/* BA */ {1,14,{22}},
/* BB */ {0,16,{0}},
/* BC */ {1,8,{16}},
/* BD */ {1,7,{22}},
/* BE */ {0,16,{0}},
/* BF */ {1,5,{5}},
/* C0 */ {4,3,{9,13,17,22}},
/* C1 */ {0,16,{0}},
/* C2 */ {0,16,{0}},
/* C3 */ {4,3,{7,10,14,19}},
/* C4 */ {4,1,{5,12,16,22}},
/* C5 */ {0,16,{0}},
/* C6 */ {0,16,{0}},
/* C7 */ {0,16,{0}},
/* C8 */ {1,11,{16}},
/* C9 */ {0,16,{0}},
/* CA */ {1,7,{10}},
/* CB */ {1,1,{1}},
/* CC */ {0,16,{0}},
/* CD */ {1,13,{7}},
/* CE */ {0,16,{0}},
/* CF */ {3,10,{12,18,22}},
/* D0 */ {2,7,{16,23}},
/* D1 */ {0,16,{0}},
/* D2 */ {3,1,{2,14,24}},
/* D3 */ {1,8,{19}},
/* D4 */ {0,16,{0}},
/* D5 */ {0,16,{0}},
/* D6 */ {0,16,{0}},
/* D7 */ {0,16,{0}},
/* D8 */ {0,16,{0}},
/* D9 */ {0,16,{0}},
/* DA */ {1,2,{12}},
/* DB */ {1,5,{15}},
/* DC */ {1,11,{19}},
/* DD */ {1,8,{18}},
/* DE */ {1,3,{18}},
/* DF */ {0,16,{0}},
/* E0 */ {0,16,{0}},
/* E1 */ {0,16,{0}},
/* E2 */ {0,16,{0}},
/* E3 */ {1,2,{19}},
/* E4 */ {0,16,{0}},
/* E5 */ {0,16,{0}},
/* E6 */ {1,13,{12}},
/* E7 */ {0,16,{0}},
/* E8 */ {4,1,{20,21,23,24}},
/* E9 */ {1,16,{11}},
/* EA */ {1,10,{15}},
/* EB */ {3,1,{8,19,22}},
/* EC */ {2,13,{20,21}},
/* ED */ {0,16,{0}},
/* EE */ {0,16,{0}},
/* EF */ {1,6,{17}},
/* F0 */ {1,1,{19}},
/* F1 */ {1,5,{14}},
/* F2 */ {1,9,{17}},
/* F3 */ {1,3,{13}},
/* F4 */ {1,14,{9}},
/* F5 */ {0,16,{0}},
/* F6 */ {2,5,{0,23}},
/* F7 */ {3,2,{0,14,17}},
/* F8 */ {0,16,{0}},
/* F9 */ {0,16,{0}},
/* FA */ {4,5,{14,15,17,21}},
/* FB */ {2,2,{1,14}},
/* FC */ {8,2,{2,4,4,5,6,8,18,21}},
/* FD */ {0,16,{0}},
/* FE */ {0,16,{0}},
/* FF */ {7,1,{5,7,10,12,16,20,21}},
      };

#define  UC  ~(unsigned char)

static struct SHdata
   {
   int  name;
   unsigned char context [16];
   }  SHa [] =
   {
/*  0 */ { 11,{ UC 0x1E, UC 0x06, UC 0x50, UC 0x53, UC 0x51, UC 0x52, UC 0x0E, UC 0x1F, UC 0x0E, UC 0x07, UC 0xF6, UC 0x06, UC 0xF7, UC 0x7D, UC 0x01, UC 0x75 }},
/*  1 */ { 19,{ UC 0x3E, UC 0x3E, UC 0x00, UC 0xCB, UC 0x3C, UC 0x75, UC 0x08, UC 0x1E, UC 0x8D, UC 0x06, UC 0x3B, UC 0x02, UC 0x50, UC 0xFB, UC 0xCB, UC 0xB8 }},
/*  2 */ { 20,{ UC 0x1E, UC 0x50, UC 0x80, UC 0xFC, UC 0x02, UC 0x72, UC 0x17, UC 0x80, UC 0xFC, UC 0x04, UC 0x73, UC 0x12, UC 0x0A, UC 0xD2, UC 0x75, UC 0x0E }},
/*  3 */ { 23,{ UC 0x06, UC 0x53, UC 0x0E, UC 0x1F, UC 0xB4, UC 0x02, UC 0xB0, UC 0x01, UC 0x8A, UC 0x2E, UC 0x1E, UC 0x7C, UC 0x8A, UC 0x0E, UC 0x1F, UC 0x7C }},
/*  4 */ { 41,{ UC 0x06, UC 0x56, UC 0x57, UC 0x55, UC 0x1E, UC 0x51, UC 0x80, UC 0xFC, UC 0x3F, UC 0x74, UC 0xB0, UC 0x50, UC 0x53, UC 0x52, UC 0x80, UC 0xFC }},
/*  5 */ {  0,{ UC 0x80, UC 0xFC, UC 0x4B, UC 0x74, UC 0x10, UC 0x2E, UC 0xFF, UC 0x2E, UC 0x37, UC 0x01, UC 0xBF, UC 0xAA, UC 0x55, UC 0x2E, UC 0xC4, UC 0x06 }},
/*  6 */ { 29,{ UC 0x50, UC 0x53, UC 0x51, UC 0x52, UC 0x57, UC 0x56, UC 0x1E, UC 0x06, UC 0x80, UC 0xFC, UC 0x4B, UC 0x74, UC 0x0D, UC 0x07, UC 0x1F, UC 0x5E }},
/*  7 */ { 30,{ UC 0x0E, UC 0x07, UC 0xCD, UC 0x13, UC 0x5B, UC 0x59, UC 0x58, UC 0x5F, UC 0x5E, UC 0x07, UC 0x1F, UC 0x5A, UC 0xC3, UC 0x2E, UC 0xFF, UC 0x0E }},
/*  8 */ { 31,{ UC 0x51, UC 0x56, UC 0x57, UC 0x55, UC 0x06, UC 0x52, UC 0x1E, UC 0x1E, UC 0x07, UC 0x80, UC 0xFC, UC 0x4B, UC 0x74, UC 0x03, UC 0xEB, UC 0x3A }},
/*  9 */ { 40,{ UC 0x75, UC 0xF4, UC 0x06, UC 0x33, UC 0xC0, UC 0x50, UC 0x8E, UC 0xC0, UC 0x26, UC 0xA0, UC 0x6C, UC 0x04, UC 0x24, UC 0x07, UC 0x40, UC 0x40 }},
/* 10 */ { 33,{ UC 0x2E, UC 0xFF, UC 0x36, UC 0x45, UC 0x01, UC 0xC3, UC 0x3D, UC 0x15, UC 0xCA, UC 0x75, UC 0x19, UC 0x2E, UC 0x3B, UC 0x1E, UC 0x19, UC 0x01 }},
/* 11 */ { 38,{ UC 0x3D, UC 0x00, UC 0x4C, UC 0x58, UC 0x75, UC 0x15, UC 0x9C, UC 0x50, UC 0x53, UC 0x51, UC 0x52, UC 0x56, UC 0x57, UC 0x06, UC 0x1E, UC 0xE9 }},
/* 12 */ { 32,{ UC 0x8A, UC 0xC4, UC 0xE6, UC 0x42, UC 0x58, UC 0xCF, UC 0x50, UC 0x51, UC 0x52, UC 0x57, UC 0x1E, UC 0x06, UC 0x8B, UC 0xDA, UC 0x33, UC 0xFF }},
/* 13 */ { 34,{ UC 0xB8, UC 0x00, UC 0x01, UC 0x2E, UC 0xA3, UC 0x2E, UC 0x01, UC 0x58, UC 0x2E, UC 0xA3, UC 0x30, UC 0x01, UC 0xF3, UC 0xA4, UC 0x33, UC 0xC0 }},
/* 14 */ { 36,{ UC 0xFB, UC 0x9C, UC 0x3D, UC 0x01, UC 0xC3, UC 0x75, UC 0x08, UC 0x81, UC 0xFA, UC 0xF1, UC 0xF1, UC 0x75, UC 0x02, UC 0xF7, UC 0xD2, UC 0x3D }},
/* 15 */ { 37,{ UC 0x8B, UC 0xFA, UC 0x8A, UC 0x15, UC 0x80, UC 0xEA, UC 0x40, UC 0x33, UC 0xDB, UC 0x8E, UC 0xDB, UC 0x80, UC 0x3F, UC 0x01, UC 0x74, UC 0x0D }},
/* 16 */ { 42,{ UC 0x83, UC 0xC4, UC 0x08, UC 0x8C, UC 0xC8, UC 0x8E, UC 0xD0, UC 0xBC, UC 0xD0, UC 0x05, UC 0x06, UC 0x06, UC 0x33, UC 0xFF, UC 0x0E, UC 0x07 }},
/* 17 */ { 39,{ UC 0x30, UC 0xC0, UC 0x8B, UC 0xFA, UC 0x1E, UC 0x07, UC 0xF2, UC 0xAE, UC 0x83, UC 0xEF, UC 0x04, UC 0x8B, UC 0xF7, UC 0x56, UC 0x0E, UC 0x07 }},
/* 18 */ {  9,{ UC 0xB8, UC 0x00, UC 0x03, UC 0x9D, UC 0xCF, UC 0x80, UC 0xFC, UC 0xDD, UC 0x74, UC 0x13, UC 0x80, UC 0xFC, UC 0xDE, UC 0x74, UC 0x28, UC 0x3D }},
/* 19 */ {  9,{ UC 0x88, UC 0x47, UC 0x02, UC 0x8B, UC 0xDC, UC 0xB1, UC 0x04, UC 0xD3, UC 0xEB, UC 0x83, UC 0xC3, UC 0x20, UC 0x83, UC 0xE3, UC 0xF0, UC 0x2E }},
/* 20 */ { 17,{ UC 0x55, UC 0x8B, UC 0xEC, UC 0xFF, UC 0x76, UC 0x06, UC 0x9D, UC 0x5D, UC 0x9C, UC 0xE8, UC 0x28, UC 0x03, UC 0x3D, UC 0x21, UC 0x25, UC 0x74 }},
/* 21 */ { 17,{ UC 0x55, UC 0x8B, UC 0xEC, UC 0xFF, UC 0x76, UC 0x06, UC 0x9D, UC 0x5D, UC 0x9C, UC 0xE8, UC 0xAF, UC 0x03, UC 0x80, UC 0xFC, UC 0x11, UC 0x74 }},
/* 22 */ { 24,{ UC 0x9D, UC 0xBA, UC 0x90, UC 0x19, UC 0xCF, UC 0x5A, UC 0x1F, UC 0xEB, UC 0xBD, UC 0x33, UC 0xC0, UC 0x8E, UC 0xC0, UC 0x26, UC 0xC4, UC 0x06 }},
/* 23 */ { 35,{ UC 0xE8, UC 0x08, UC 0x0B, UC 0xE8, UC 0xD0, UC 0x0A, UC 0xE8, UC 0x9A, UC 0x0A, UC 0xE8, UC 0xF6, UC 0x0A, UC 0xE8, UC 0xB4, UC 0x0A, UC 0x53 }},
/* 24 */ { 15,{ UC 0xE8, UC 0x7D, UC 0x01, UC 0x33, UC 0xD2, UC 0xB9, UC 0x19, UC 0x04, UC 0x90, UC 0xE8, UC 0x66, UC 0x01, UC 0x72, UC 0x71, UC 0xE8, UC 0x46 }}
   };

static struct DESTROY
   {
   int count;         /* количество прерываний, используемых вирусом    */
   int type [5];      /* способ нейтрализации: 1 - memCOPY, 2 - memSET  */
   int target [5];    /* смещ.начала прер-я относ-но найденного шаблона */
   int sourse [5];    /* смещ.инструкции JMP to_int относ-но --"--      */
   int modify [5];    /* количество модифицируемых байтов               */
   }
     DEstroy [] =
   {
/*  0 */ {2,{1,1},{0,0x20F},{0x59,0x2F8},{5,5}},
/*  1 */ {2,{2,2},{0x223,0x236},{0x90,0xEB},{2,1}},
/*  2 */ {1,{2},{5},{0xEB},{1}},
/*  3 */ {3,{1,1,1},{0x34A,0x434,0x676},{0x3F6,0x496,0x923},{5,5,5}},
/*  4 */ {1,{1},{0},{0x23},{5}},
/*  5 */ {1,{2},{3},{0x90},{2}},
/*  6 */ {1,{2},{0x0B},{0x90},{2}},
/*  7 */ {1,{1},{0x0D},{0xEA},{5}},
/*  8 */ {2,{1,2},{0xFFFE,0xFFB1},{0x53,0xCF},{5,1}},
/*  9 */ {1,{1},{0xFFE7},{0xFFF6},{5}},
/* 10 */ {1,{1},{0},{0x48},{5}},
/* 11 */ {1,{1},{0xFFF3},{0x1B},{10}},
/* 12 */ {2,{1,2},{0xFFD6,0xFFF1},{0xFFDE,0xCF},{5,1}},
/* 13 */ {1,{1},{0xFFED},{0xFFF9},{5}},
/* 14 */ {2,{2,2},{0x12,0x161},{0x90,0xCF},{2,1}},
/* 15 */ {3,{1,2,1},{0xFFE5,0xFFF5,0xFC63},{0x26,0xCF,0xFCD2},{11,1,11}},
/* 16 */ {2,{1,1},{0xFFE8,0x40F},{0xFFF7,0x41F},{5,5}},
/* 17 */ {1,{1},{0xFFE5},{0x53},{5}},
/* 18 */ {2,{2,1},{0x14,0xFFBD},{0x90,0xFFF5},{3,5}},
/* 19 */ {2,{2,1},{0x196,0xC5},{0x90,0xFB},{3,5}},
/* 20 */ {2,{1,2},{0,0xFFBC},{0xFFF2,0x90},{5,3}},
/* 21 */ {2,{1,2},{0,0xFFD8},{0xFFED,0x90},{5,3}},
/* 22 */ {1,{1},{0xFFAD},{0xFFF4},{5}},
/* 23 */ {1,{2},{0x16},{0xEB},{1}},
/* 24 */ {1,{1},{0xFEB3},{0xFEC0},{11}}
   };

void Check_res_part ()
{
register unsigned int k;
register int i,j;
char * targ,* sour;
/***************************************************************************/

point.ptr = (char far *) 0;
my_ram = *RAM;

for (l=0; l<my_ram; l+=32)
   {
   printf ("\rПроверено: %3d Кбайт",l);
   if ((my_ram-l) > 32) part = 0x8010;
   else                 part = (my_ram-l) * 0x400;
   
   Buffer = point.ptr;
   offp=16;
   do {
      cur_table = Tables + Buffer [offp-1];
      for (j=0; j<cur_table->count_con; j++)
         {
         NumCon = cur_table->num_con [j];      /* номер контекста */
         cont = SHa [NumCon].context;          /* адрес контекста */
         k = offp;                             /* текущий адрес   */
         i = 16;
         do { i--; k--; if (i<0) break; }
         while ( (~(cont [i]) & 0xFF) == Buffer [k] );
         if (i<0)
            {
            printf ("\rпо адресу %4.4X:%4.4X найден вирус %s, ",
                       point.w.seg, offp-16, m1 [SHa [NumCon].name]);
            for (i=0; i<DEstroy [NumCon].count; i++)
               {
               j = DEstroy [NumCon].modify [i];
               targ = Buffer + (offp - 16 + DEstroy [NumCon].target [i]);
               if (DEstroy [NumCon].type [i] == 1)
                  {
                  sour = Buffer + (offp - 16 + DEstroy [NumCon].sourse [i]);
                  memcpy (targ, sour, j);
                  printf ("нейтрализован.");
                  }
               else
               if (DEstroy [NumCon].type [i] == 2)
                  {
                  sour = (char *) (DEstroy [NumCon].sourse);
                  memset (targ, * sour, j);
                  printf ("нейтрализован.");
                  }
               else
                  printf ("не могу нейтрализовать!");
               }
            printf ("\n");
            break;
            }
         }
      offp += cur_table->shift;
      }
   while (offp < part);

   point.w.off = 0;
   point.w.seg += 0x800;
   }
printf ("\rПроверено: %3d Кбайт",l);
k=getch();
if (!k) k=getch();
return;
}
/***************************************************************************/

