//╔═════════════════════════════════════════════════════════════════════════╗
//║                                                                         ║
//║	    Module name	: 	check_y_range.c                             ║
//║   	    Date	: 	3 July 1991                                 ║
//║    	    Environment	: 	Turbo C++ 1.0                               ║
//║    	    Language    :       Turbo C                                     ║
//║    	    Author	: 	Melnik Oleg                                 ║
//║    	    Notice	:                                                   ║
//║                                                                         ║
//╚═════════════════════════════════════════════════════════════════════════╝

#include	"mbe.h"
//_______________________________________________

void check_y_range( int y, int yn )
{
//_______________________________________________

     if(( y + yn - 1 ) > 25 )
     {
	  put_error("Объект выходит за вертикальные пределы экрана");
     }
//_______________________________________________
}