//╔═════════════════════════════════════════════════════════════════════════╗
//║                                                                         ║
//║	    Module name	: 	check_x_range.c                             ║
//║   	    Date	: 	3 July 1991                                 ║
//║    	    Environment	: 	Turbo C++ 1.0                               ║
//║    	    Language    :       Turbo C                                     ║
//║    	    Author	: 	Melnik Oleg                                 ║
//║    	    Notice	:                                                   ║
//║                                                                         ║
//╚═════════════════════════════════════════════════════════════════════════╝

#include	"mbe.h"
//_______________________________________________

void check_x_range( int x, int xn )
{
//_______________________________________________

     if(( x + xn - 1 ) > 80 )
     {
	  put_error("Объект выходит за горизонтальные пределы экрана");
     }
//_______________________________________________
}