//╔═════════════════════════════════════════════════════════════════════════╗
//║                                                                         ║
//║	    Module name	: 	stardelay_c.c                               ║
//║   	    Date	: 	5 July 1991                                 ║
//║    	    Environment	: 	Turbo C++ 1.0                               ║
//║    	    Language    :       Turbo C                                     ║
//║    	    Author	: 	Melnik Oleg                                 ║
//║    	    Notice	:                                                   ║
//║                                                                         ║
//╚═════════════════════════════════════════════════════════════════════════╝

#include	"mbe.h"
//_______________________________________________

void stardelay_c( void )
{
//_______________________________________________

     extern int star_delay;
//_______________________________________________

     star_delay = tok_int();
     if( star_delay < 1 )
     {
	 put_error("Задержка до тушения экрана не может быть меньше 1");
     }
//_______________________________________________
}