//╔═════════════════════════════════════════════════════════════════════════╗
//║                                                                         ║
//║	    Module name	: 	tok_str.c                                   ║
//║   	    Date	: 	3 July 1991                                 ║
//║    	    Environment	: 	Turbo C++ 1.0                               ║
//║    	    Language    :       Turbo C                                     ║
//║    	    Author	: 	Melnik Oleg                                 ║
//║    	    Notice	:                                                   ║
//║                                                                         ║
//╚═════════════════════════════════════════════════════════════════════════╝

#ifndef		_STRING_H
#include	<string.h>
#endif

#include	"mbe.h"
//_______________________________________________

void tok_str( void )
{
//_______________________________________________

     extern char tmp_str[ 255 ];
//_______________________________________________

     strcpy( tmp_str, strtok( NULL, "\xff"));
     if( tmp_str[ 0 ])
     {
	 return;
     }
     else
     {
	 put_error("Команда должна содержать строку");
     }
//_______________________________________________
}