
           {----------------------------------------------}
           {        Программа SetGame V 1.0               }
           {----------------------------------------------}
           { Язык программирования Turbo Pascal V 6.0     }
           {----------------------------------------------}
           { Дата создания : 23/03/1992                   }
           {----------------------------------------------}
           { Программа устанавливает допустимое кол-во    }
           { раз доступа к графическим видеорежимам запре-}
           { щаемых резидентной программой AntiGame       }
           {----------------------------------------------}
           {  (c) 1992, Ярослав Мигач                     }
           {----------------------------------------------}

PROGRAM SetGame;

USES SGP;

VAR
    Counter : BYTE;
    Err : INTEGER;

BEGIN
     IF ( PARAMSTR ( 1 ) = '' ) THEN
        HALT ( 1 );
     WRITELN;
     WRITELN ( 'SetGame V 1.0  (c) 1992  Ярослав Мигач' );
     WRITELN ( '' );
     VAL ( PARAMSTR ( 1 ), Counter, Err );
     IF ( Err <> 0 ) THEN
        HALT ( 1 );
     SetGraphPassword ( Counter );
     WRITELN ( 'OK' )

END.