
            {---------------------------------------------------}
            {             Модуль  SGP  V 1.0                    }
            {---------------------------------------------------}
            { Язык программирования : TurboPascal V 6.0         }
            {---------------------------------------------------}
            { Дата последних изменений : 19/03/1992             }
            {---------------------------------------------------}
            { Модуль предназначен для поддержки резидентной     }
            { программы ANTIGAME                                }
            {---------------------------------------------------}
            { (c) 1992 Мигач Ярослав                            }
            {---------------------------------------------------}

UNIT SGP;

{$F+,O+,A+,B-,D-,L-,R-,S-,I-,V-}

INTERFACE

USES Dos;

PROCEDURE SetGraphPassword ( Num : BYTE );

IMPLEMENTATION

PROCEDURE SetGraphPassword ( Num : BYTE );

          { Устанавливает счетчик санкционорованного доступа }

VAR
   RG : REGISTERS;

BEGIN
     Rg.AH := $0EE;
     Rg.AL := Num;
     INTR ( $10, Rg )

END; { procedure SetGraphPassword }

END.
